Repository: naomifacestudio-create/naomifacestudio
Catalog: locale/*/LC_MESSAGES/django.po
Languages: hr

source: Croatian Content
hr: Hrvatski sadržaj

source: English Content
hr: Engleski sadržaj

source: Blog Details
hr: Detalji bloga

source: Blogs
hr: Blogovi

source: Title (Croatian)
hr: Naslov (hrvatski)

source: Slug (Croatian)
hr: Slug (hrvatski)

source: Short Description (Croatian)
hr: Kratak opis (hrvatski)

source: Full Description (Croatian)
hr: Puni opis (hrvatski)

source: Meta Description (Croatian)
hr: Meta opis (hrvatski)

source: Title (English)
hr: Naslov (engleski)

source: Slug (English)
hr: Slug (engleski)

source: Short Description (English)
hr: Kratak opis (engleski)

source: Full Description (English)
hr: Puni opis (engleski)

source: Meta Description (English)
hr: Meta opis (engleski)

source: Thumbnail Image
hr: Sličica

source: Supports WebP format
hr: Podržava WebP format

source: Active
hr: Aktivno

source: Contacts
hr: Kontakti

source: First Name
hr: Ime

source: Last Name
hr: Prezime

source: Mobile Number
hr: Broj mobitela

source: Email Address
hr: Email adresa

source: Message
hr: Poruka

source: Read
hr: Pročitano

source: Contact Submission
hr: Kontakt forma

source: Contact Submissions
hr: Kontakt forme

source: Too many requests. Please try again later.
hr: Previše zahtjeva. Molimo pokušajte ponovno kasnije.

source: Please fill in all required fields.
hr: Molimo ispunite sva obavezna polja.

source: Thank you for your message! We will get back to you soon.
hr: Hvala vam na poruci! Javit ćemo vam se uskoro.

source: New Contact Form Submission from %(name)s
hr: Nova poruka iz kontakt forme od %(name)s

source: Export selected emails as CSV
hr: Izvezi odabrane emailove kao CSV

source: Export selected emails as text (one per line)
hr: Izvezi odabrane emailove kao tekst (jedan po redu)

source: Core
hr: Osnovno

source: Email Collection
hr: Zbirka emailova

source: Email Collections
hr: Zbirka emailova

source: Home
hr: Početna

source: About Me
hr: O meni

source: Account created successfully!
hr: Račun je uspješno kreiran!

source: Welcome back!
hr: Dobrodošli natrag!

source: Invalid username or password.
hr: Nevažeće korisničko ime ili lozinka.

source: You have been logged out successfully.
hr: Uspješno ste odjavljeni.

source: Education Details
hr: Detalji edukacije

source: Education
hr: Edukacija

source: Price
hr: Cijena

source: Gift Vouchers
hr: Poklon vaučeri

source: Send the gift voucher to my email address
hr: Pošalji poklon vaučer na moju email adresu

source: Send the gift voucher to recipient's email address
hr: Pošalji poklon vaučer na email adresu primatelja

source: Email Delivery Option
hr: Opcija isporuke emaila

source: Recipient Name
hr: Ime primatelja

source: Personalised Message
hr: Personalizirana poruka

source: Who is this gift from?
hr: Tko šalje ovaj poklon?

source: Recipient Email Address
hr: Email adresa primatelja

source: Email Sent
hr: Email poslan

source: Gift Voucher
hr: Poklon vaučer

source: Gift voucher order submitted successfully!
hr: Narudžba poklon vaučera je uspješno poslana!

source: New Gift Voucher Order - %(name)s
hr: Nova narudžba poklon vaučera - %(name)s

source: Gift Voucher Order Confirmation - %(treatment)s
hr: Potvrda narudžbe poklon vaučera - %(treatment)s

source: You received a Gift Voucher! - %(treatment)s
hr: Primili ste poklon vaučer! - %(treatment)s

source: Site Administration
hr: Administracija stranice

source: Reservations
hr: Rezervacije

source: Pending
hr: Na čekanju

source: Confirmed
hr: Potvrđeno

source: Cancelled
hr: Otkazano

source: Completed
hr: Završeno

source: Date
hr: Datum

source: Start Time
hr: Vrijeme početka

source: End Time
hr: Vrijeme završetka

source: Notes
hr: Napomene

source: Reservation
hr: Rezervacija

source: Reservation Confirmation - %(treatment)s
hr: Potvrda rezervacije - %(treatment)s

source: New Reservation - %(treatment)s
hr: Nova rezervacija - %(treatment)s

source: Reservation Cancelled - %(treatment)s
hr: Rezervacija otkazana - %(treatment)s

source: Start typing to filter…
hr: Počnite tipkati za filtriranje…

source: Filter navigation items
hr: Filtriraj stavke navigacije

source: View Calendar
hr: Prikaži kalendar

source: Reservation Calendar
hr: Kalendar rezervacija

source: Previous
hr: Prethodno

source: Next
hr: Sljedeće

source: January
hr: Siječanj

source: February
hr: Veljača

source: March
hr: Ožujak

source: April
hr: Travanj

source: May
hr: Svibanj

source: June
hr: Lipanj

source: July
hr: Srpanj

source: August
hr: Kolovoz

source: September
hr: Rujan

source: October
hr: Listopad

source: November
hr: Studeni

source: December
hr: Prosinac

source: Mon
hr: Pon

source: Tue
hr: Uto

source: Wed
hr: Sri

source: Thu
hr: Čet

source: Fri
hr: Pet

source: Sat
hr: Sub

source: Sun
hr: Ned

source: Reservations for
hr: Rezervacije za

source: Client
hr: Klijent

source: Mobile
hr: Mobitel

source: Time
hr: Vrijeme

source: View/Edit
hr: Prikaži/Uredi

source: No reservations for
hr: Nema rezervacija za

source: No reservations scheduled for this date.
hr: Nema zakazanih rezervacija za ovaj datum.

source: Error loading reservations
hr: Greška pri učitavanju rezervacija

source: Read our latest blog posts about skincare, beauty tips, and facial treatments.
hr: Pročitajte naše najnovije blog objave o njezi kože, savjetima za ljepotu i tretmanima lica.

source: Our Blog
hr: Naš blog

source: See more
hr: Vidi više

source: No blog posts available at the moment.
hr: Trenutno nema dostupnih blog objava.

source: New Contact Form Submission
hr: Nova poruka iz kontakt forme

source: Name:
hr: Ime:

source: Mobile:
hr: Mobitel:

source: Message:
hr: Poruka:

source: Contact
hr: Kontakt

source: Get in touch with Naomi Face Studio. Contact us via email, phone, or fill out our contact form.
hr: Kontaktirajte Naomi Face Studio. Javite nam se putem emaila, telefona ili popunite naš kontakt obrazac.

source: Contact Us
hr: Kontaktirajte nas

source: Send Message
hr: Pošalji poruku

source: Learn more about Maja Divjaković, medical cosmetologist and certified therapist specializing in Forlle'd professional treatments and Face Gym techniques.
hr: Saznajte više o Maji Divjaković, medicinskoj kozmetičarki i certificiranoj terapeutkinji specijaliziranoj za Forlle'd profesionalne tretmane i Face Gym tehnike.

source: My name is Maja Divjaković and I am a medical cosmetologist with years of experience working in wellness centers and aesthetic clinics.
hr: Moje ime je Maja Divjaković i medicinski sam kozmetičar s višegodišnjim iskustvom rada u wellnesima i estetskim centrima.

source: Over the years, I have developed a unique approach that combines expertise and luxury with an emphasis on results that are visible immediately, but also on the feeling of complete relaxation and harmony.
hr: Kroz godine rada razvila sam poseban pristup koji spaja stručnost i luksuz s naglaskom na rezultate koji se vide odmah, ali i na osjećaj potpune opuštenosti i harmonije.

source: I specialize in Forlle'd professional treatments – exclusive Japanese cosmetics for anti-age care – and I am a certified therapist. In addition to ritual treatments, I am dedicated to Face Gym techniques that naturally shape and firm the face, activating more than 40 muscles and restoring the skin's tone and freshness.
hr: Specijalizirala sam se za Forlle'd profesionalne tretmane – ekskluzivnu japansku kozmetiku za anti-age njegu – te sam certificirani terapeut. Osim ritualnih tretmana, posvećena sam i Face Gym tehnikama koje prirodnim putem oblikuju i učvršćuju lice, aktivirajući više od 40 mišića te vraćajući koži tonus i svježinu.

source: My vision is to raise awareness about the importance of quality and personalized facial care and to bring clients an experience that goes beyond classic treatments.
hr: Moja vizija je podići svijest o važnosti kvalitetne i personalizirane njege lica te približiti klijentima iskustvo koje nadilazi klasične tretmane.

source: At Naomi Face Studio, I want to offer each client more than just care – a space where beauty and skin health meet with ritual, luxury, and inner balance.
hr: U Naomi Face Studiju želim svakom klijentu pružiti više od njege – prostor gdje se ljepota i zdravlje kože susreću s ritualom, luksuzom i unutarnjim balansom.

source: My Account
hr: Moj račun

source: View and manage your account information and reservations.
hr: Pregledajte i upravljajte informacijama o svom računu i rezervacijama.

source: Personal Information
hr: Osobni podaci

source: Username
hr: Korisničko ime

source: Upcoming Reservations
hr: Predstojeće rezervacije

source: Date:
hr: Datum:

source: Time:
hr: Vrijeme:

source: Price:
hr: Cijena:

source: Cancel
hr: Otkaži

source: You have no upcoming reservations.
hr: Nemate predstojećih rezervacija.

source: Book a Treatment
hr: Rezerviraj tretman

source: Past Reservations
hr: Prošle rezervacije

source: View all past reservations
hr: Prikaži sve prošle rezervacije

source: Are you sure you want to cancel this reservation?
hr: Jeste li sigurni da želite otkazati ovu rezervaciju?

source: Reservation cancelled successfully
hr: Rezervacija je uspješno otkazana

source: Error cancelling reservation
hr: Greška pri otkazivanju rezervacije

source: Naomi Face Studio - Premium facial treatments combining ritual care, modern anti-age methods, and luxury Japanese cosmetics.
hr: Naomi Face Studio - Premium tretmani lica koji spajaju ritualnu njegu, suvremene anti-age metode i luksuznu japansku kozmetiku.

source: Naomi Face Studio is a place where facial treatments are elevated to a higher level – a combination of ritual care, modern anti-age methods, and luxury Japanese cosmetics.
hr: Naomi Face Studio je mjesto gdje se tretmani lica podižu na višu razinu – spoj ritualne njege, suvremenih anti-age metoda i luksuzne japanske kozmetike.

source: In a space dedicated to peace and harmony, every treatment becomes a special experience of shaping and renewing the skin, but also a moment of deep relaxation.
hr: U prostoru posvećenom miru i harmoniji, svaki tretman postaje posebno iskustvo oblikovanja i obnavljanja kože, ali i trenutak dubokog opuštanja.

source: Through a combination of precise massage techniques, premium preparations, and an individual approach, we restore the face's natural vitality, radiance, and youthful freshness.
hr: Kombinacijom preciznih tehnika masaže, vrhunskih preparata i individualnog pristupa vraćamo licu prirodnu vitalnost, sjaj i mladenačku svježinu.

source: Naomi is a place where beauty comes from within – and the results are visible immediately.
hr: Naomi je mjesto gdje ljepota dolazi iznutra – a rezultati se vide odmah.

source: Frequently Asked Questions
hr: Često postavljana pitanja

source: How do I book a treatment?
hr: Kako mogu rezervirati tretman?

source: You can book a treatment by clicking on the 'Reservations' button in the navigation menu or directly from a treatment page. You'll need to create an account first if you don't have one.
hr: Možete rezervirati tretman klikom na gumb 'Rezervacije' u navigacijskom izborniku ili izravno s stranice tretmana. Najprije ćete trebati kreirati račun ako ga nemate.

source: What are your working hours?
hr: Koje su vaše radno vrijeme?

source: Monday: 12:00 - 20:00, Tuesday - Friday: 09:00 - 17:00, Saturday - Sunday: Closed
hr: Ponedjeljak: 12:00 - 20:00, Utorak - Petak: 09:00 - 17:00, Subota - Nedjelja: Zatvoreno

source: Can I cancel my reservation?
hr: Mogu li otkazati rezervaciju?

source: Yes, you can cancel your reservation from your account's 'My Reservations' page.
hr: Da, možete otkazati rezervaciju s stranice 'Moje rezervacije' na vašem računu.

source: You can book a treatment by clicking on the Reservations button in the navigation menu or directly from a treatment page. You will need to create an account first if you do not have one.
hr: Možete rezervirati tretman klikom na gumb Rezervacije u navigacijskom izborniku ili izravno s stranice tretmana. Najprije ćete trebati kreirati račun ako ga nemate.

source: Yes, you can cancel your reservation from your accounts My Reservations page.
hr: Da, možete otkazati rezervaciju s stranice Moje rezervacije na vašem računu.

source: Login
hr: Prijava

source: Login to your account at Naomi Face Studio.
hr: Prijavite se na svoj račun u Naomi Face Studio.

source: Username or Email
hr: Korisničko ime ili Email

source: Password
hr: Lozinka

source: Don't have an account?
hr: Nemate račun?

source: Sign up here
hr: Registrirajte se ovdje

source: Sign Up
hr: Registracija

source: Create an account to book treatments at Naomi Face Studio.
hr: Kreirajte račun za rezervaciju tretmana u Naomi Face Studio.

source: Create Account
hr: Kreiraj račun

source: Confirm Password
hr: Potvrdite lozinku

source: Already have an account?
hr: Već imate račun?

source: Login here
hr: Prijavite se ovdje

source: Explore our educational courses and training programs.
hr: Istražite naše obrazovne tečajeve i programe edukacije.

source: No education courses available at the moment.
hr: Trenutno nema dostupnih obrazovnih tečajeva.

source: New Gift Voucher Order
hr: Nova narudžba poklon vaučera

source: Order Details
hr: Detalji narudžbe

source: Treatment:
hr: Tretman:

source: Recipient Name:
hr: Ime primatelja:

source: From:
hr: Od:

source: Personalised Message:
hr: Personalizirana poruka:

source: Purchaser Details
hr: Detalji kupca

source: Email Delivery:
hr: Isporuka emaila:

source: Recipient Email:
hr: Email primatelja:

source: Gift Voucher Order Confirmation
hr: Potvrda narudžbe poklon vaučera

source: Thank you for your gift voucher order!
hr: Hvala vam na narudžbi poklon vaučera!

source: Recipient:
hr: Primatelj:

source: You Received a Gift Voucher!
hr: Primili ste poklon vaučer!

source: Dear
hr: Poštovani

source: You have received a gift voucher for a facial treatment at Naomi Face Studio!
hr: Primili ste poklon vaučer za tretman lica u Naomi Face Studio!

source: Gift Voucher Details
hr: Detalji poklon vaučera

source: Please contact us to book your treatment.
hr: Molimo kontaktirajte nas za rezervaciju vašeg tretmana.

source: Purchase a gift voucher for a loved one. Choose from our range of facial treatments.
hr: Kupite poklon vaučer za voljenu osobu. Odaberite iz naše ponude tretmana lica.

source: Select a treatment
hr: Odaberite tretman

source: -- Select Treatment --
hr: -- Odaberite tretman --

source: Confirmation of purchase will be sent to this email address
hr: Potvrda kupnje bit će poslana na ovu email adresu

source: Gift voucher details
hr: Detalji poklon vaučera

source: Recipient name
hr: Ime primatelja

source: Personalised message
hr: Personalizirana poruka

source: Recipient email address
hr: Email adresa primatelja

source: Purchaser details
hr: Detalji kupca

source: First name
hr: Ime

source: Last name
hr: Prezime

source: Email address
hr: Email adresa

source: Mobile number
hr: Broj mobitela

source: Submit Order
hr: Pošalji narudžbu

source: We use cookies to enhance your browsing experience. By continuing to use this site, you consent to our use of cookies.
hr: Koristimo kolačiće za poboljšanje vašeg iskustva pregledavanja. Nastavkom korištenja ove stranice pristajete na korištenje kolačića.

source: Accept
hr: Prihvati

source: All rights reserved.
hr: Sva prava pridržana.

source: About me
hr: O meni

source: Treatments
hr: Tretmani

source: Logout
hr: Odjava

source: Book your facial treatment appointment at Naomi Face Studio.
hr: Rezervirajte termin za tretman lica u Naomi Face Studio.

source: Book Your Treatment
hr: Rezervirajte vaš tretman

source: You need to create an account to make a reservation.
hr: Morate kreirati račun za izradu rezervacije.

source: Create Account / Login
hr: Kreiraj račun / Prijava

source: Select Treatment
hr: Odaberite tretman

source: Selected Time:
hr: Odabrano vrijeme:

source: Message (optional)
hr: Poruka (opcionalno)

source: Add any special requests or notes...
hr: Dodajte posebne zahtjeve ili napomene...

source: Submit Reservation
hr: Pošalji rezervaciju

source: Please select a treatment first
hr: Molimo prvo odaberite tretman

source: Error loading available slots. Please try again.
hr: Greška pri učitavanju dostupnih termina. Molimo pokušajte ponovno.

source: No available slots for this date
hr: Nema dostupnih termina za ovaj datum

source: This day is closed (Saturday or Sunday)
hr: Ovaj dan je zatvoren (subota ili nedjelja)

source: No available time slots for this date. All slots may be booked.
hr: Nema dostupnih vremenskih termina za ovaj datum. Svi termini mogu biti rezervirani.

source: Please select a date, treatment, and time
hr: Molimo odaberite datum, tretman i vrijeme

source: Reservation created successfully!
hr: Rezervacija je uspješno kreirana!

source: Error creating reservation
hr: Greška pri kreiranju rezervacije

source: New Reservation
hr: Nova rezervacija

source: Reservation Details
hr: Detalji rezervacije

source: Duration:
hr: Trajanje:

source: Customer Information
hr: Podaci o klijentu

source: Not provided
hr: Nije navedeno

source: Reservation Cancelled
hr: Rezervacija otkazana

source: Cancelled Reservation Details
hr: Detalji otkazane rezervacije

source: Reservation Confirmation
hr: Potvrda rezervacije

source: Your reservation has been confirmed!
hr: Vaša rezervacija je potvrđena!

source: We look forward to seeing you!
hr: Radujemo se što ćemo vas vidjeti!

source: My Reservations
hr: Moje rezervacije

source: You have no reservations.
hr: Nemate rezervacija.

source: Explore our range of premium facial treatments at Naomi Face Studio.
hr: Istražite našu ponudu premium tretmana lica u Naomi Face Studio.

source: Our Treatments
hr: Naši tretmani

source: No treatments available at the moment.
hr: Trenutno nema dostupnih tretmana.

source: Treatment Details
hr: Detalji tretmana

source: Duration (Hours)
hr: Trajanje (sati)

source: Duration (Minutes)
hr: Trajanje (minute)

source: Treatment
hr: Tretman
